# 7.4 Форматирование строк
# Задача Мастера кода и Волшебники данных

team1 = '<Мастера кода>'
team2 = '<Волшебники данных>'

team1_num = 5  # количество участников 1 команды
team2_num = 6 # количество участников 2 команды

score_1 = 40
score_2 = 42

team1_time = 1552.512
team2_time = 2153.31451

tasks_total = 82

time_avg = 45.2
# Использование %:
print('В команде %s участников %s!' % (team1, team1_num))
print('Итого сегодня в командах участников: %s и %s!' % (team1_num, team2_num))
# Использование format():
print('Команда {} решила задач: {}!'.format(team2, score_2))
print('{} решили задачи за {} c!'.format(team2, team2_time))
# Использование f-строк:





